{
    "project1": {
        "title1": "Проект №1",
        "title2": "Веб-приложение для отображения LIVE информации о текущем игровом матче.",
        "title3": "Итоги:",
        "description": {
            "part1": "Заказчик поставил непростую задачу: нужно было найти подход для отображения информации из игрового матча. У клиента был бэкенд с данными, которые выходят в конце матча.Разобравшись в системе, выяснилось, что информацию можно передавать не только в конце матча, но и каждый раз когда игровой процесс обновляется. Решение пришло сразу же, можно использовать Web-страницу для отображения информации и оформить её в виде виджетов с greenscreen. Таким образом, используя страницу в приложении для потоковой передачи OBS, также использую фильтр для удаления greenscreen'а можно получить все данные в красивом виде.",
            "part2": "После тщательного планирования, я начал делать первый прототип с шаблона.Так как бекэнд не был еще разработан, использован фейк-дату (не настоящий json файл).Распарсил данные и добавил их во фронт. Делая страницу веба, использовал React и  Semantic UI.",
            "part3": "Как получил одобрение от клиента, продолжил разработку, использовал таймер, который меняет каждые 10 секунд ТАБ с общей информацией, чтобы в ручную её не переключать.Отсортировал данные, которые приходят с бэкенда, для лучшего отображения. Добавил ПРОГРЕССБАР, чтобы пользователи видели кто лидирует в выбранной категории.",
            "part4": "После того, как бэкенд был готов, улучшил соединение с бэкендом, добавив доп. информацию. Улучшил отображение иконок. Добавил время игры.",
            "part5": "Я сделал веб-приложение, использовав свои знания в ВЕБе и вёрстке, также здесь благодаря тому, что хорошо разбираюсь в программе OBS из-за проведения стримов и записи видеороликов. Такие нестандартные знания помогли решенить проблему красивоого отображения информации и удовлетворить клиента.Само приложение может развиваться дальше, отображать еще больше информации в виде ГРАФИКОВ(золота, опыта, уровней и т.д.) с течением времени.Отображение эффектов победы/поражение. Убийств, смертей и т.д.Также благодаря приложению можно привлечь новую аудиторию, что поможет развить еще лучше проект."
        },
        "subheading": {
            "part1": "Изначальный прототип в paint",
            "part2": "Шаблон в программе прототипирования",
            "part3": "Первый рабочий прототип",
            "part4": "Второй рабочий прототип",
            "part5": "Готовое веб-приложение в OBS",
            "part6": "Готовое веб-приложение в браузере"
        }
    },
    "project2": {
        "title1": "Проект №2",
        "title2": "Particle-эффекты.",
        "title3": "Итоги:",
        "description": {
            "part1": "Заказчик предложил сделать эффекты для большинства героев в игре Minecraft в проекте под названием Mobs and Thrones. Задача была не простой, сделать около 20 эффектов, которые бы отображали способности в игре, к примеру эффект замедление вражеского персонажа или эффект лечения.",
            "part2": "В игре присутствовали минимальные эффекты: телепортации, ударов, вампиризма. Как раз они и послужили мне хорошим примером. Нужно сказать, что я до этого никогда не работал на языке JAVA, но был знаком и делал пару задач на этом языке.",
            "part3": "Перед тем как начать, я ознакомился с существующим кодом, разобрал как он работает в теории и на практике. Прочитал статьи про Particle-эффекты и сделал первые тестовые шаги. Создавал функции-методы для их вызова.",
            "part4": "В течении 4х дней я сделал все эффекты, которые были необходимы. Игра получилась насыщенной и красивой, благодаря этому игроки ощутили визуальное удовлетворение и интерес попробовать поиграть на всех героях.",
            "part5": "Изучая другие технологии можно узнать что-то новое для себя. В этот раз, разрабатывая этот проект с эффектами, получил новый опыт, который, возможно, применю в будущем. Видеть как твои старания работают, а помимо этого еще и приносят удовольствие и развлекают людей - это огромный успех и удовлетворение!"
        },
        "subheading": {
            "part1": "Эффект лечения и защиты, который сделал",
            "part2": "JAVA Код эффекта телепорта",
            "part3": "Статья про эффекты в клиенте Minecraft",
            "part4": "Готовые Particle-эффекты и часть матча игры",
            "part5": "Готовые Particle-эффекты и часть матча игры"
        }
    }
}